def @main(%input_1_int8: Tensor[(1, 96, 96, 3), int8] /* ty=Tensor[(1, 96, 96, 3), int8] span=input_1_int8:0:0 */, output_tensor_names=["Identity_int8"]) -> Tensor[(1, 2), int8] {
  %0 = @tvmgen_default_cmsis_nn_main_0(%input_1_int8, meta[relay.Constant][0] /* ty=Tensor[(8, 3, 3, 3), int8] */, meta[relay.Constant][1] /* ty=Tensor[(8), int32] */, meta[relay.Constant][2] /* ty=Tensor[(8), float32] span=model/activation/Relu;model/batch_normalization/FusedBatchNormV3;model/conv2d/BiasAdd/ReadVariableOp/resource;model/conv2d/BiasAdd;model/depthwise_conv2d/depthwise;model/conv2d/Conv2D1:0:0 */, meta[relay.Constant][3] /* ty=Tensor[(8), int32] */, meta[relay.Constant][4] /* ty=Tensor[(8), float32] span=model/activation/Relu;model/batch_normalization/FusedBatchNormV3;model/conv2d/BiasAdd/ReadVariableOp/resource;model/conv2d/BiasAdd;model/depthwise_conv2d/depthwise;model/conv2d/Conv2D1:0:0 */, meta[relay.Constant][5] /* ty=Tensor[(8), int32] */) /* ty=Tensor[(1, 48, 48, 8), int8] */;
  %1 = @tvmgen_default_cmsis_nn_main_1(%0, meta[relay.Constant][6] /* ty=Tensor[(3, 3, 8, 1), int8] */, meta[relay.Constant][7] /* ty=Tensor[(8), int32] */, meta[relay.Constant][8] /* ty=Tensor[(8), float32] span=model/activation_1/Relu;model/batch_normalization_1/FusedBatchNormV3;model/depthwise_conv2d/depthwise;model/depthwise_conv2d/BiasAdd;model/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][9] /* ty=Tensor[(8), int32] */, meta[relay.Constant][10] /* ty=Tensor[(8), float32] span=model/activation_1/Relu;model/batch_normalization_1/FusedBatchNormV3;model/depthwise_conv2d/depthwise;model/depthwise_conv2d/BiasAdd;model/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][11] /* ty=Tensor[(8), int32] */) /* ty=Tensor[(1, 48, 48, 8), int8] */;
  %2 = @tvmgen_default_cmsis_nn_main_2(%1, meta[relay.Constant][12] /* ty=Tensor[(16, 1, 1, 8), int8] */, meta[relay.Constant][13] /* ty=Tensor[(16), int32] */, meta[relay.Constant][14] /* ty=Tensor[(16), float32] span=model/activation_2/Relu;model/batch_normalization_2/FusedBatchNormV3;model/conv2d_1/BiasAdd/ReadVariableOp/resource;model/conv2d_1/BiasAdd;model/depthwise_conv2d_1/depthwise;model/conv2d_1/Conv2D1:0:0 */, meta[relay.Constant][15] /* ty=Tensor[(16), int32] */, meta[relay.Constant][16] /* ty=Tensor[(16), float32] span=model/activation_2/Relu;model/batch_normalization_2/FusedBatchNormV3;model/conv2d_1/BiasAdd/ReadVariableOp/resource;model/conv2d_1/BiasAdd;model/depthwise_conv2d_1/depthwise;model/conv2d_1/Conv2D1:0:0 */, meta[relay.Constant][17] /* ty=Tensor[(16), int32] */) /* ty=Tensor[(1, 48, 48, 16), int8] */;
  %3 = @tvmgen_default_cmsis_nn_main_3(%2, meta[relay.Constant][18] /* ty=Tensor[(3, 3, 16, 1), int8] */, meta[relay.Constant][19] /* ty=Tensor[(16), int32] */, meta[relay.Constant][20] /* ty=Tensor[(16), float32] span=model/activation_3/Relu;model/batch_normalization_3/FusedBatchNormV3;model/depthwise_conv2d_1/depthwise;model/depthwise_conv2d_1/BiasAdd;model/depthwise_conv2d_1/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][21] /* ty=Tensor[(16), int32] */, meta[relay.Constant][22] /* ty=Tensor[(16), float32] span=model/activation_3/Relu;model/batch_normalization_3/FusedBatchNormV3;model/depthwise_conv2d_1/depthwise;model/depthwise_conv2d_1/BiasAdd;model/depthwise_conv2d_1/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][23] /* ty=Tensor[(16), int32] */) /* ty=Tensor[(1, 24, 24, 16), int8] */;
  %4 = @tvmgen_default_cmsis_nn_main_4(%3, meta[relay.Constant][24] /* ty=Tensor[(32, 1, 1, 16), int8] */, meta[relay.Constant][25] /* ty=Tensor[(32), int32] */, meta[relay.Constant][26] /* ty=Tensor[(32), float32] span=model/activation_4/Relu;model/batch_normalization_4/FusedBatchNormV3;model/conv2d_2/BiasAdd/ReadVariableOp/resource;model/conv2d_2/BiasAdd;model/depthwise_conv2d_3/depthwise;model/conv2d_2/Conv2D1:0:0 */, meta[relay.Constant][27] /* ty=Tensor[(32), int32] */, meta[relay.Constant][28] /* ty=Tensor[(32), float32] span=model/activation_4/Relu;model/batch_normalization_4/FusedBatchNormV3;model/conv2d_2/BiasAdd/ReadVariableOp/resource;model/conv2d_2/BiasAdd;model/depthwise_conv2d_3/depthwise;model/conv2d_2/Conv2D1:0:0 */, meta[relay.Constant][29] /* ty=Tensor[(32), int32] */) /* ty=Tensor[(1, 24, 24, 32), int8] */;
  %5 = @tvmgen_default_cmsis_nn_main_5(%4, meta[relay.Constant][30] /* ty=Tensor[(3, 3, 32, 1), int8] */, meta[relay.Constant][31] /* ty=Tensor[(32), int32] */, meta[relay.Constant][32] /* ty=Tensor[(32), float32] span=model/activation_5/Relu;model/batch_normalization_5/FusedBatchNormV3;model/depthwise_conv2d_2/depthwise;model/depthwise_conv2d_2/BiasAdd;model/depthwise_conv2d_3/depthwise;model/depthwise_conv2d_2/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][33] /* ty=Tensor[(32), int32] */, meta[relay.Constant][34] /* ty=Tensor[(32), float32] span=model/activation_5/Relu;model/batch_normalization_5/FusedBatchNormV3;model/depthwise_conv2d_2/depthwise;model/depthwise_conv2d_2/BiasAdd;model/depthwise_conv2d_3/depthwise;model/depthwise_conv2d_2/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][35] /* ty=Tensor[(32), int32] */) /* ty=Tensor[(1, 24, 24, 32), int8] */;
  %6 = @tvmgen_default_cmsis_nn_main_6(%5, meta[relay.Constant][36] /* ty=Tensor[(32, 1, 1, 32), int8] */, meta[relay.Constant][37] /* ty=Tensor[(32), int32] */, meta[relay.Constant][38] /* ty=Tensor[(32), float32] span=model/activation_6/Relu;model/batch_normalization_6/FusedBatchNormV3;model/conv2d_3/BiasAdd/ReadVariableOp/resource;model/conv2d_3/BiasAdd;model/depthwise_conv2d_3/depthwise;model/conv2d_3/Conv2D1:0:0 */, meta[relay.Constant][39] /* ty=Tensor[(32), int32] */, meta[relay.Constant][40] /* ty=Tensor[(32), float32] span=model/activation_6/Relu;model/batch_normalization_6/FusedBatchNormV3;model/conv2d_3/BiasAdd/ReadVariableOp/resource;model/conv2d_3/BiasAdd;model/depthwise_conv2d_3/depthwise;model/conv2d_3/Conv2D1:0:0 */, meta[relay.Constant][41] /* ty=Tensor[(32), int32] */) /* ty=Tensor[(1, 24, 24, 32), int8] */;
  %7 = @tvmgen_default_cmsis_nn_main_7(%6, meta[relay.Constant][42] /* ty=Tensor[(3, 3, 32, 1), int8] */, meta[relay.Constant][43] /* ty=Tensor[(32), int32] */, meta[relay.Constant][44] /* ty=Tensor[(32), float32] span=model/activation_7/Relu;model/batch_normalization_7/FusedBatchNormV3;model/depthwise_conv2d_3/depthwise;model/depthwise_conv2d_3/BiasAdd;model/depthwise_conv2d_3/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][45] /* ty=Tensor[(32), int32] */, meta[relay.Constant][46] /* ty=Tensor[(32), float32] span=model/activation_7/Relu;model/batch_normalization_7/FusedBatchNormV3;model/depthwise_conv2d_3/depthwise;model/depthwise_conv2d_3/BiasAdd;model/depthwise_conv2d_3/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][47] /* ty=Tensor[(32), int32] */) /* ty=Tensor[(1, 12, 12, 32), int8] */;
  %8 = @tvmgen_default_cmsis_nn_main_8(%7, meta[relay.Constant][48] /* ty=Tensor[(64, 1, 1, 32), int8] */, meta[relay.Constant][49] /* ty=Tensor[(64), int32] */, meta[relay.Constant][50] /* ty=Tensor[(64), float32] span=model/activation_8/Relu;model/batch_normalization_8/FusedBatchNormV3;model/conv2d_4/BiasAdd/ReadVariableOp/resource;model/conv2d_4/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_4/Conv2D1:0:0 */, meta[relay.Constant][51] /* ty=Tensor[(64), int32] */, meta[relay.Constant][52] /* ty=Tensor[(64), float32] span=model/activation_8/Relu;model/batch_normalization_8/FusedBatchNormV3;model/conv2d_4/BiasAdd/ReadVariableOp/resource;model/conv2d_4/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_4/Conv2D1:0:0 */, meta[relay.Constant][53] /* ty=Tensor[(64), int32] */) /* ty=Tensor[(1, 12, 12, 64), int8] */;
  %9 = @tvmgen_default_cmsis_nn_main_9(%8, meta[relay.Constant][54] /* ty=Tensor[(3, 3, 64, 1), int8] */, meta[relay.Constant][55] /* ty=Tensor[(64), int32] */, meta[relay.Constant][56] /* ty=Tensor[(64), float32] span=model/activation_9/Relu;model/batch_normalization_9/FusedBatchNormV3;model/depthwise_conv2d_4/depthwise;model/depthwise_conv2d_4/BiasAdd;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_4/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][57] /* ty=Tensor[(64), int32] */, meta[relay.Constant][58] /* ty=Tensor[(64), float32] span=model/activation_9/Relu;model/batch_normalization_9/FusedBatchNormV3;model/depthwise_conv2d_4/depthwise;model/depthwise_conv2d_4/BiasAdd;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_4/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][59] /* ty=Tensor[(64), int32] */) /* ty=Tensor[(1, 12, 12, 64), int8] */;
  %10 = @tvmgen_default_cmsis_nn_main_10(%9, meta[relay.Constant][60] /* ty=Tensor[(64, 1, 1, 64), int8] */, meta[relay.Constant][61] /* ty=Tensor[(64), int32] */, meta[relay.Constant][62] /* ty=Tensor[(64), float32] span=model/activation_10/Relu;model/batch_normalization_10/FusedBatchNormV3;model/conv2d_5/BiasAdd/ReadVariableOp/resource;model/conv2d_5/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_5/Conv2D1:0:0 */, meta[relay.Constant][63] /* ty=Tensor[(64), int32] */, meta[relay.Constant][64] /* ty=Tensor[(64), float32] span=model/activation_10/Relu;model/batch_normalization_10/FusedBatchNormV3;model/conv2d_5/BiasAdd/ReadVariableOp/resource;model/conv2d_5/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_5/Conv2D1:0:0 */, meta[relay.Constant][65] /* ty=Tensor[(64), int32] */) /* ty=Tensor[(1, 12, 12, 64), int8] */;
  %11 = @tvmgen_default_cmsis_nn_main_11(%10, meta[relay.Constant][66] /* ty=Tensor[(3, 3, 64, 1), int8] */, meta[relay.Constant][67] /* ty=Tensor[(64), int32] */, meta[relay.Constant][68] /* ty=Tensor[(64), float32] span=model/activation_11/Relu;model/batch_normalization_11/FusedBatchNormV3;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_5/BiasAdd;model/depthwise_conv2d_5/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][69] /* ty=Tensor[(64), int32] */, meta[relay.Constant][70] /* ty=Tensor[(64), float32] span=model/activation_11/Relu;model/batch_normalization_11/FusedBatchNormV3;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_5/BiasAdd;model/depthwise_conv2d_5/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][71] /* ty=Tensor[(64), int32] */) /* ty=Tensor[(1, 6, 6, 64), int8] */;
  %12 = @tvmgen_default_cmsis_nn_main_12(%11, meta[relay.Constant][72] /* ty=Tensor[(128, 1, 1, 64), int8] */, meta[relay.Constant][73] /* ty=Tensor[(128), int32] */, meta[relay.Constant][74] /* ty=Tensor[(128), float32] span=model/activation_12/Relu;model/batch_normalization_12/FusedBatchNormV3;model/conv2d_6/BiasAdd/ReadVariableOp/resource;model/conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_6/Conv2D1:0:0 */, meta[relay.Constant][75] /* ty=Tensor[(128), int32] */, meta[relay.Constant][76] /* ty=Tensor[(128), float32] span=model/activation_12/Relu;model/batch_normalization_12/FusedBatchNormV3;model/conv2d_6/BiasAdd/ReadVariableOp/resource;model/conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_6/Conv2D1:0:0 */, meta[relay.Constant][77] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 6, 6, 128), int8] */;
  %13 = @tvmgen_default_cmsis_nn_main_13(%12, meta[relay.Constant][78] /* ty=Tensor[(3, 3, 128, 1), int8] */, meta[relay.Constant][79] /* ty=Tensor[(128), int32] */, meta[relay.Constant][80] /* ty=Tensor[(128), float32] span=model/activation_13/Relu;model/batch_normalization_13/FusedBatchNormV3;model/depthwise_conv2d_6/depthwise;model/depthwise_conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_6/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][81] /* ty=Tensor[(128), int32] */, meta[relay.Constant][82] /* ty=Tensor[(128), float32] span=model/activation_13/Relu;model/batch_normalization_13/FusedBatchNormV3;model/depthwise_conv2d_6/depthwise;model/depthwise_conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_6/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][83] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 6, 6, 128), int8] */;
  %14 = @tvmgen_default_cmsis_nn_main_14(%13, meta[relay.Constant][84] /* ty=Tensor[(128, 1, 1, 128), int8] */, meta[relay.Constant][85] /* ty=Tensor[(128), int32] */, meta[relay.Constant][86] /* ty=Tensor[(128), float32] span=model/activation_14/Relu;model/batch_normalization_14/FusedBatchNormV3;model/conv2d_7/BiasAdd/ReadVariableOp/resource;model/conv2d_7/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_7/Conv2D1:0:0 */, meta[relay.Constant][87] /* ty=Tensor[(128), int32] */, meta[relay.Constant][88] /* ty=Tensor[(128), float32] span=model/activation_14/Relu;model/batch_normalization_14/FusedBatchNormV3;model/conv2d_7/BiasAdd/ReadVariableOp/resource;model/conv2d_7/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_7/Conv2D1:0:0 */, meta[relay.Constant][89] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 6, 6, 128), int8] */;
  %15 = @tvmgen_default_cmsis_nn_main_15(%14, meta[relay.Constant][90] /* ty=Tensor[(3, 3, 128, 1), int8] */, meta[relay.Constant][91] /* ty=Tensor[(128), int32] */, meta[relay.Constant][92] /* ty=Tensor[(128), float32] span=model/activation_15/Relu;model/batch_normalization_15/FusedBatchNormV3;model/depthwise_conv2d_7/depthwise;model/depthwise_conv2d_7/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_7/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][93] /* ty=Tensor[(128), int32] */, meta[relay.Constant][94] /* ty=Tensor[(128), float32] span=model/activation_15/Relu;model/batch_normalization_15/FusedBatchNormV3;model/depthwise_conv2d_7/depthwise;model/depthwise_conv2d_7/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_7/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][95] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 6, 6, 128), int8] */;
  %16 = @tvmgen_default_cmsis_nn_main_16(%15, meta[relay.Constant][96] /* ty=Tensor[(128, 1, 1, 128), int8] */, meta[relay.Constant][97] /* ty=Tensor[(128), int32] */, meta[relay.Constant][98] /* ty=Tensor[(128), float32] span=model/activation_16/Relu;model/batch_normalization_16/FusedBatchNormV3;model/conv2d_8/BiasAdd/ReadVariableOp/resource;model/conv2d_8/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_8/Conv2D1:0:0 */, meta[relay.Constant][99] /* ty=Tensor[(128), int32] */, meta[relay.Constant][100] /* ty=Tensor[(128), float32] span=model/activation_16/Relu;model/batch_normalization_16/FusedBatchNormV3;model/conv2d_8/BiasAdd/ReadVariableOp/resource;model/conv2d_8/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_8/Conv2D1:0:0 */, meta[relay.Constant][101] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 6, 6, 128), int8] */;
  %17 = @tvmgen_default_cmsis_nn_main_17(%16, meta[relay.Constant][102] /* ty=Tensor[(3, 3, 128, 1), int8] */, meta[relay.Constant][103] /* ty=Tensor[(128), int32] */, meta[relay.Constant][104] /* ty=Tensor[(128), float32] span=model/activation_17/Relu;model/batch_normalization_17/FusedBatchNormV3;model/depthwise_conv2d_8/depthwise;model/depthwise_conv2d_8/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_8/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][105] /* ty=Tensor[(128), int32] */, meta[relay.Constant][106] /* ty=Tensor[(128), float32] span=model/activation_17/Relu;model/batch_normalization_17/FusedBatchNormV3;model/depthwise_conv2d_8/depthwise;model/depthwise_conv2d_8/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_8/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][107] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 6, 6, 128), int8] */;
  %18 = @tvmgen_default_cmsis_nn_main_18(%17, meta[relay.Constant][108] /* ty=Tensor[(128, 1, 1, 128), int8] */, meta[relay.Constant][109] /* ty=Tensor[(128), int32] */, meta[relay.Constant][110] /* ty=Tensor[(128), float32] span=model/activation_18/Relu;model/batch_normalization_18/FusedBatchNormV3;model/conv2d_9/BiasAdd/ReadVariableOp/resource;model/conv2d_9/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_9/Conv2D1:0:0 */, meta[relay.Constant][111] /* ty=Tensor[(128), int32] */, meta[relay.Constant][112] /* ty=Tensor[(128), float32] span=model/activation_18/Relu;model/batch_normalization_18/FusedBatchNormV3;model/conv2d_9/BiasAdd/ReadVariableOp/resource;model/conv2d_9/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_9/Conv2D1:0:0 */, meta[relay.Constant][113] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 6, 6, 128), int8] */;
  %19 = @tvmgen_default_cmsis_nn_main_19(%18, meta[relay.Constant][114] /* ty=Tensor[(3, 3, 128, 1), int8] */, meta[relay.Constant][115] /* ty=Tensor[(128), int32] */, meta[relay.Constant][116] /* ty=Tensor[(128), float32] span=model/activation_19/Relu;model/batch_normalization_19/FusedBatchNormV3;model/depthwise_conv2d_9/depthwise;model/depthwise_conv2d_9/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_9/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][117] /* ty=Tensor[(128), int32] */, meta[relay.Constant][118] /* ty=Tensor[(128), float32] span=model/activation_19/Relu;model/batch_normalization_19/FusedBatchNormV3;model/depthwise_conv2d_9/depthwise;model/depthwise_conv2d_9/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_9/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][119] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 6, 6, 128), int8] */;
  %20 = @tvmgen_default_cmsis_nn_main_20(%19, meta[relay.Constant][120] /* ty=Tensor[(128, 1, 1, 128), int8] */, meta[relay.Constant][121] /* ty=Tensor[(128), int32] */, meta[relay.Constant][122] /* ty=Tensor[(128), float32] span=model/activation_20/Relu;model/batch_normalization_20/FusedBatchNormV3;model/conv2d_10/BiasAdd/ReadVariableOp/resource;model/conv2d_10/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_10/Conv2D1:0:0 */, meta[relay.Constant][123] /* ty=Tensor[(128), int32] */, meta[relay.Constant][124] /* ty=Tensor[(128), float32] span=model/activation_20/Relu;model/batch_normalization_20/FusedBatchNormV3;model/conv2d_10/BiasAdd/ReadVariableOp/resource;model/conv2d_10/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_10/Conv2D1:0:0 */, meta[relay.Constant][125] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 6, 6, 128), int8] */;
  %21 = @tvmgen_default_cmsis_nn_main_21(%20, meta[relay.Constant][126] /* ty=Tensor[(3, 3, 128, 1), int8] */, meta[relay.Constant][127] /* ty=Tensor[(128), int32] */, meta[relay.Constant][128] /* ty=Tensor[(128), float32] span=model/activation_21/Relu;model/batch_normalization_21/FusedBatchNormV3;model/depthwise_conv2d_10/depthwise;model/depthwise_conv2d_10/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_10/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][129] /* ty=Tensor[(128), int32] */, meta[relay.Constant][130] /* ty=Tensor[(128), float32] span=model/activation_21/Relu;model/batch_normalization_21/FusedBatchNormV3;model/depthwise_conv2d_10/depthwise;model/depthwise_conv2d_10/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_10/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][131] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 6, 6, 128), int8] */;
  %22 = @tvmgen_default_cmsis_nn_main_22(%21, meta[relay.Constant][132] /* ty=Tensor[(128, 1, 1, 128), int8] */, meta[relay.Constant][133] /* ty=Tensor[(128), int32] */, meta[relay.Constant][134] /* ty=Tensor[(128), float32] span=model/activation_22/Relu;model/batch_normalization_22/FusedBatchNormV3;model/conv2d_11/BiasAdd/ReadVariableOp/resource;model/conv2d_11/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_11/Conv2D1:0:0 */, meta[relay.Constant][135] /* ty=Tensor[(128), int32] */, meta[relay.Constant][136] /* ty=Tensor[(128), float32] span=model/activation_22/Relu;model/batch_normalization_22/FusedBatchNormV3;model/conv2d_11/BiasAdd/ReadVariableOp/resource;model/conv2d_11/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_11/Conv2D1:0:0 */, meta[relay.Constant][137] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 6, 6, 128), int8] */;
  %23 = @tvmgen_default_cmsis_nn_main_23(%22, meta[relay.Constant][138] /* ty=Tensor[(3, 3, 128, 1), int8] */, meta[relay.Constant][139] /* ty=Tensor[(128), int32] */, meta[relay.Constant][140] /* ty=Tensor[(128), float32] span=model/activation_23/Relu;model/batch_normalization_23/FusedBatchNormV3;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_11/BiasAdd;model/depthwise_conv2d_11/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][141] /* ty=Tensor[(128), int32] */, meta[relay.Constant][142] /* ty=Tensor[(128), float32] span=model/activation_23/Relu;model/batch_normalization_23/FusedBatchNormV3;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_11/BiasAdd;model/depthwise_conv2d_11/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][143] /* ty=Tensor[(128), int32] */) /* ty=Tensor[(1, 3, 3, 128), int8] */;
  %24 = @tvmgen_default_cmsis_nn_main_24(%23, meta[relay.Constant][144] /* ty=Tensor[(256, 1, 1, 128), int8] */, meta[relay.Constant][145] /* ty=Tensor[(256), int32] */, meta[relay.Constant][146] /* ty=Tensor[(256), float32] span=model/activation_24/Relu;model/batch_normalization_24/FusedBatchNormV3;model/conv2d_12/BiasAdd/ReadVariableOp/resource;model/conv2d_12/BiasAdd;model/conv2d_13/Conv2D;model/conv2d_12/Conv2D1:0:0 */, meta[relay.Constant][147] /* ty=Tensor[(256), int32] */, meta[relay.Constant][148] /* ty=Tensor[(256), float32] span=model/activation_24/Relu;model/batch_normalization_24/FusedBatchNormV3;model/conv2d_12/BiasAdd/ReadVariableOp/resource;model/conv2d_12/BiasAdd;model/conv2d_13/Conv2D;model/conv2d_12/Conv2D1:0:0 */, meta[relay.Constant][149] /* ty=Tensor[(256), int32] */) /* ty=Tensor[(1, 3, 3, 256), int8] */;
  %25 = @tvmgen_default_cmsis_nn_main_25(%24, meta[relay.Constant][150] /* ty=Tensor[(3, 3, 256, 1), int8] */, meta[relay.Constant][151] /* ty=Tensor[(256), int32] */, meta[relay.Constant][152] /* ty=Tensor[(256), float32] span=model/activation_25/Relu;model/batch_normalization_25/FusedBatchNormV3;model/depthwise_conv2d_12/depthwise;model/depthwise_conv2d_12/BiasAdd;model/conv2d_13/Conv2D;model/depthwise_conv2d_12/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][153] /* ty=Tensor[(256), int32] */, meta[relay.Constant][154] /* ty=Tensor[(256), float32] span=model/activation_25/Relu;model/batch_normalization_25/FusedBatchNormV3;model/depthwise_conv2d_12/depthwise;model/depthwise_conv2d_12/BiasAdd;model/conv2d_13/Conv2D;model/depthwise_conv2d_12/BiasAdd/ReadVariableOp/resource1:0:0 */, meta[relay.Constant][155] /* ty=Tensor[(256), int32] */) /* ty=Tensor[(1, 3, 3, 256), int8] */;
  %26 = @tvmgen_default_cmsis_nn_main_26(%25, meta[relay.Constant][156] /* ty=Tensor[(256, 1, 1, 256), int8] */, meta[relay.Constant][157] /* ty=Tensor[(256), int32] */, meta[relay.Constant][158] /* ty=Tensor[(256), float32] span=model/activation_26/Relu;model/batch_normalization_26/FusedBatchNormV3;model/conv2d_13/BiasAdd/ReadVariableOp/resource;model/conv2d_13/BiasAdd;model/conv2d_13/Conv2D1:0:0 */, meta[relay.Constant][159] /* ty=Tensor[(256), int32] */, meta[relay.Constant][160] /* ty=Tensor[(256), float32] span=model/activation_26/Relu;model/batch_normalization_26/FusedBatchNormV3;model/conv2d_13/BiasAdd/ReadVariableOp/resource;model/conv2d_13/BiasAdd;model/conv2d_13/Conv2D1:0:0 */, meta[relay.Constant][161] /* ty=Tensor[(256), int32] */) /* ty=Tensor[(1, 3, 3, 256), int8] */;
  %27 = @tvmgen_default_cmsis_nn_main_27(%26) /* ty=Tensor[(1, 1, 1, 256), int8] */;
  %28 = reshape(%27, newshape=[-1, 256]) /* ty=Tensor[(1, 256), int8] span=model/flatten/Reshape:0:0 */;
  %29 = reshape(%28, newshape=[-1, 256]) /* ty=Tensor[(1, 256), int8] span=model/dense/MatMul;model/dense/BiasAdd:0:0 */;
  %30 = @tvmgen_default_cmsis_nn_main_28(%29, meta[relay.Constant][162] /* ty=Tensor[(2, 256), int8] */, meta[relay.Constant][163] /* ty=Tensor[(2), int32] */) /* ty=Tensor[(1, 2), int8] */;
  @tvmgen_default_cmsis_nn_main_29(%30) /* ty=Tensor[(1, 2), int8] */
}

def @tvmgen_default_cmsis_nn_main_0(%cmsis-nn_0_i0: Tensor[(1, 96, 96, 3), int8] /* ty=Tensor[(1, 96, 96, 3), int8] */, %tvm_var_extract_const_6: Tensor[(8, 3, 3, 3), int8] /* ty=Tensor[(8, 3, 3, 3), int8] */, %tvm_var_extract_const_7: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, %tvm_var_extract_const_8: Tensor[(8), float32] /* ty=Tensor[(8), float32] */, %tvm_var_extract_const_9: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, %tvm_var_extract_const_10: Tensor[(8), float32] /* ty=Tensor[(8), float32] */, %tvm_var_extract_const_11: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, Compiler="cmsis-nn", Primitive=1, Inline=1, global_symbol="tvmgen_default_cmsis_nn_main_0") -> Tensor[(1, 48, 48, 8), int8] {
  %34 = fn (%FunctionVar_26_0: Tensor[(1, 96, 96, 3), int8] /* ty=Tensor[(1, 96, 96, 3), int8] */, %tvm_var_extract_const_0: Tensor[(8, 3, 3, 3), int8] /* ty=Tensor[(8, 3, 3, 3), int8] */, %tvm_var_extract_const_1: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, %tvm_var_extract_const_2: Tensor[(8), float32] /* ty=Tensor[(8), float32] */, %tvm_var_extract_const_3: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, %tvm_var_extract_const_4: Tensor[(8), float32] /* ty=Tensor[(8), float32] */, %tvm_var_extract_const_5: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, PartitionedFromPattern="qnn.conv2d_nn.bias_add_qnn.requantize_clip_", Composite="cmsis-nn.qnn_conv2d") -> Tensor[(1, 48, 48, 8), int8] {
    %31 = qnn.conv2d(%FunctionVar_26_0, %tvm_var_extract_const_0, -128 /* ty=int32 span=model/activation/Relu;model/batch_normalization/FusedBatchNormV3;model/conv2d/BiasAdd/ReadVariableOp/resource;model/conv2d/BiasAdd;model/depthwise_conv2d/depthwise;model/conv2d/Conv2D1:0:0 */, %tvm_var_extract_const_1, 0.00392157f /* ty=float32 span=model/activation/Relu;model/batch_normalization/FusedBatchNormV3;model/conv2d/BiasAdd/ReadVariableOp/resource;model/conv2d/BiasAdd;model/depthwise_conv2d/depthwise;model/conv2d/Conv2D1:0:0 */, %tvm_var_extract_const_2, strides=[2, 2], padding=[0, 0, 1, 1], channels=8, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="OHWI", out_dtype="int32") /* ty=Tensor[(1, 48, 48, 8), int32] span=model/activation/Relu;model/batch_normalization/FusedBatchNormV3;model/conv2d/BiasAdd/ReadVariableOp/resource;model/conv2d/BiasAdd;model/depthwise_conv2d/depthwise;model/conv2d/Conv2D1:0:0 */;
    %32 = nn.bias_add(%31, %tvm_var_extract_const_3, axis=3) /* ty=Tensor[(1, 48, 48, 8), int32] span=model/activation/Relu;model/batch_normalization/FusedBatchNormV3;model/conv2d/BiasAdd/ReadVariableOp/resource;model/conv2d/BiasAdd;model/depthwise_conv2d/depthwise;model/conv2d/Conv2D1:0:0 */;
    %33 = qnn.requantize(%32, %tvm_var_extract_const_4, %tvm_var_extract_const_5, 0.01497f /* ty=float32 span=model/activation/Relu;model/batch_normalization/FusedBatchNormV3;model/conv2d/BiasAdd/ReadVariableOp/resource;model/conv2d/BiasAdd;model/depthwise_conv2d/depthwise;model/conv2d/Conv2D1:0:0 */, -128 /* ty=int32 span=model/activation/Relu;model/batch_normalization/FusedBatchNormV3;model/conv2d/BiasAdd/ReadVariableOp/resource;model/conv2d/BiasAdd;model/depthwise_conv2d/depthwise;model/conv2d/Conv2D1:0:0 */, axis=3, out_dtype="int8") /* ty=Tensor[(1, 48, 48, 8), int8] span=model/activation/Relu;model/batch_normalization/FusedBatchNormV3;model/conv2d/BiasAdd/ReadVariableOp/resource;model/conv2d/BiasAdd;model/depthwise_conv2d/depthwise;model/conv2d/Conv2D1:0:0 */;
    clip(%33, a_min=-128f, a_max=127f) /* ty=Tensor[(1, 48, 48, 8), int8] span=model/activation/Relu;model/batch_normalization/FusedBatchNormV3;model/conv2d/BiasAdd/ReadVariableOp/resource;model/conv2d/BiasAdd;model/depthwise_conv2d/depthwise;model/conv2d/Conv2D1:0:0 */
  } /* ty=fn (Tensor[(1, 96, 96, 3), int8], Tensor[(8, 3, 3, 3), int8], Tensor[(8), int32], Tensor[(8), float32], Tensor[(8), int32], Tensor[(8), float32], Tensor[(8), int32]) -> Tensor[(1, 48, 48, 8), int8] */;
  %34(%cmsis-nn_0_i0, %tvm_var_extract_const_6, %tvm_var_extract_const_7, %tvm_var_extract_const_8, %tvm_var_extract_const_9, %tvm_var_extract_const_10, %tvm_var_extract_const_11) /* ty=Tensor[(1, 48, 48, 8), int8] */
}

def @tvmgen_default_cmsis_nn_main_1(%cmsis-nn_1_i0: Tensor[(1, 48, 48, 8), int8] /* ty=Tensor[(1, 48, 48, 8), int8] */, %tvm_var_extract_const_24: Tensor[(3, 3, 8, 1), int8] /* ty=Tensor[(3, 3, 8, 1), int8] */, %tvm_var_extract_const_25: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, %tvm_var_extract_const_26: Tensor[(8), float32] /* ty=Tensor[(8), float32] */, %tvm_var_extract_const_27: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, %tvm_var_extract_const_28: Tensor[(8), float32] /* ty=Tensor[(8), float32] */, %tvm_var_extract_const_29: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, Compiler="cmsis-nn", Primitive=1, Inline=1, global_symbol="tvmgen_default_cmsis_nn_main_1") -> Tensor[(1, 48, 48, 8), int8] {
  %38 = fn (%FunctionVar_25_0: Tensor[(1, 48, 48, 8), int8] /* ty=Tensor[(1, 48, 48, 8), int8] */, %tvm_var_extract_const_18: Tensor[(3, 3, 8, 1), int8] /* ty=Tensor[(3, 3, 8, 1), int8] */, %tvm_var_extract_const_19: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, %tvm_var_extract_const_20: Tensor[(8), float32] /* ty=Tensor[(8), float32] */, %tvm_var_extract_const_21: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, %tvm_var_extract_const_22: Tensor[(8), float32] /* ty=Tensor[(8), float32] */, %tvm_var_extract_const_23: Tensor[(8), int32] /* ty=Tensor[(8), int32] */, PartitionedFromPattern="qnn.conv2d_nn.bias_add_qnn.requantize_clip_", Composite="cmsis-nn.qnn_conv2d") -> Tensor[(1, 48, 48, 8), int8] {
    %35 = qnn.conv2d(%FunctionVar_25_0, %tvm_var_extract_const_18, -128 /* ty=int32 span=model/activation_1/Relu;model/batch_normalization_1/FusedBatchNormV3;model/depthwise_conv2d/depthwise;model/depthwise_conv2d/BiasAdd;model/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1:0:0 */, %tvm_var_extract_const_19, 0.01497f /* ty=float32 span=model/activation_1/Relu;model/batch_normalization_1/FusedBatchNormV3;model/depthwise_conv2d/depthwise;model/depthwise_conv2d/BiasAdd;model/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1:0:0 */, %tvm_var_extract_const_20, padding=[1, 1, 1, 1], groups=8, channels=8, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="int32") /* ty=Tensor[(1, 48, 48, 8), int32] span=model/activation_1/Relu;model/batch_normalization_1/FusedBatchNormV3;model/depthwise_conv2d/depthwise;model/depthwise_conv2d/BiasAdd;model/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1:0:0 */;
    %36 = nn.bias_add(%35, %tvm_var_extract_const_21, axis=3) /* ty=Tensor[(1, 48, 48, 8), int32] span=model/activation_1/Relu;model/batch_normalization_1/FusedBatchNormV3;model/depthwise_conv2d/depthwise;model/depthwise_conv2d/BiasAdd;model/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1:0:0 */;
    %37 = qnn.requantize(%36, %tvm_var_extract_const_22, %tvm_var_extract_const_23, 0.0483876f /* ty=float32 span=model/activation_1/Relu;model/batch_normalization_1/FusedBatchNormV3;model/depthwise_conv2d/depthwise;model/depthwise_conv2d/BiasAdd;model/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1:0:0 */, -128 /* ty=int32 span=model/activation_1/Relu;model/batch_normalization_1/FusedBatchNormV3;model/depthwise_conv2d/depthwise;model/depthwise_conv2d/BiasAdd;model/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1:0:0 */, axis=3, out_dtype="int8") /* ty=Tensor[(1, 48, 48, 8), int8] span=model/activation_1/Relu;model/batch_normalization_1/FusedBatchNormV3;model/depthwise_conv2d/depthwise;model/depthwise_conv2d/BiasAdd;model/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1:0:0 */;
    clip(%37, a_min=-128f, a_max=127f) /* ty=Tensor[(1, 48, 48, 8), int8] span=model/activation_1/Relu;model/batch_normalization_1/FusedBatchNormV3;model/depthwise_conv2d/depthwise;model/depthwise_conv2d/BiasAdd;model/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1:0:0 */
  } /* ty=fn (Tensor[(1, 48, 48, 8), int8], Tensor[(3, 3, 8, 1), int8], Tensor[(8), int32], Tensor[(8), float32], Tensor[(8), int32], Tensor[(8), float32], Tensor[(8), int32]) -> Tensor[(1, 48, 48, 8), int8] */;
  %38(%cmsis-nn_1_i0, %tvm_var_extract_const_24, %tvm_var_extract_const_25, %tvm_var_extract_const_26, %tvm_var_extract_const_27, %tvm_var_extract_const_28, %tvm_var_extract_const_29) /* ty=Tensor[(1, 48, 48, 8), int8] */
}

def @tvmgen_default_cmsis_nn_main_10(%cmsis-nn_10_i0: Tensor[(1, 12, 12, 64), int8] /* ty=Tensor[(1, 12, 12, 64), int8] */, %tvm_var_extract_const_186: Tensor[(64, 1, 1, 64), int8] /* ty=Tensor[(64, 1, 1, 64), int8] */, %tvm_var_extract_const_187: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, %tvm_var_extract_const_188: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %tvm_var_extract_const_189: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, %tvm_var_extract_const_190: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %tvm_var_extract_const_191: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, Compiler="cmsis-nn", Primitive=1, Inline=1, global_symbol="tvmgen_default_cmsis_nn_main_10") -> Tensor[(1, 12, 12, 64), int8] {
  %42 = fn (%FunctionVar_16_0: Tensor[(1, 12, 12, 64), int8] /* ty=Tensor[(1, 12, 12, 64), int8] */, %tvm_var_extract_const_180: Tensor[(64, 1, 1, 64), int8] /* ty=Tensor[(64, 1, 1, 64), int8] */, %tvm_var_extract_const_181: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, %tvm_var_extract_const_182: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %tvm_var_extract_const_183: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, %tvm_var_extract_const_184: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %tvm_var_extract_const_185: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, PartitionedFromPattern="qnn.conv2d_nn.bias_add_qnn.requantize_clip_", Composite="cmsis-nn.qnn_conv2d") -> Tensor[(1, 12, 12, 64), int8] {
    %39 = qnn.conv2d(%FunctionVar_16_0, %tvm_var_extract_const_180, -128 /* ty=int32 span=model/activation_10/Relu;model/batch_normalization_10/FusedBatchNormV3;model/conv2d_5/BiasAdd/ReadVariableOp/resource;model/conv2d_5/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_5/Conv2D1:0:0 */, %tvm_var_extract_const_181, 0.0315622f /* ty=float32 span=model/activation_10/Relu;model/batch_normalization_10/FusedBatchNormV3;model/conv2d_5/BiasAdd/ReadVariableOp/resource;model/conv2d_5/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_5/Conv2D1:0:0 */, %tvm_var_extract_const_182, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1], data_layout="NHWC", kernel_layout="OHWI", out_dtype="int32") /* ty=Tensor[(1, 12, 12, 64), int32] span=model/activation_10/Relu;model/batch_normalization_10/FusedBatchNormV3;model/conv2d_5/BiasAdd/ReadVariableOp/resource;model/conv2d_5/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_5/Conv2D1:0:0 */;
    %40 = nn.bias_add(%39, %tvm_var_extract_const_183, axis=3) /* ty=Tensor[(1, 12, 12, 64), int32] span=model/activation_10/Relu;model/batch_normalization_10/FusedBatchNormV3;model/conv2d_5/BiasAdd/ReadVariableOp/resource;model/conv2d_5/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_5/Conv2D1:0:0 */;
    %41 = qnn.requantize(%40, %tvm_var_extract_const_184, %tvm_var_extract_const_185, 0.0296601f /* ty=float32 span=model/activation_10/Relu;model/batch_normalization_10/FusedBatchNormV3;model/conv2d_5/BiasAdd/ReadVariableOp/resource;model/conv2d_5/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_5/Conv2D1:0:0 */, -128 /* ty=int32 span=model/activation_10/Relu;model/batch_normalization_10/FusedBatchNormV3;model/conv2d_5/BiasAdd/ReadVariableOp/resource;model/conv2d_5/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_5/Conv2D1:0:0 */, axis=3, out_dtype="int8") /* ty=Tensor[(1, 12, 12, 64), int8] span=model/activation_10/Relu;model/batch_normalization_10/FusedBatchNormV3;model/conv2d_5/BiasAdd/ReadVariableOp/resource;model/conv2d_5/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_5/Conv2D1:0:0 */;
    clip(%41, a_min=-128f, a_max=127f) /* ty=Tensor[(1, 12, 12, 64), int8] span=model/activation_10/Relu;model/batch_normalization_10/FusedBatchNormV3;model/conv2d_5/BiasAdd/ReadVariableOp/resource;model/conv2d_5/BiasAdd;model/depthwise_conv2d_5/depthwise;model/conv2d_5/Conv2D1:0:0 */
  } /* ty=fn (Tensor[(1, 12, 12, 64), int8], Tensor[(64, 1, 1, 64), int8], Tensor[(64), int32], Tensor[(64), float32], Tensor[(64), int32], Tensor[(64), float32], Tensor[(64), int32]) -> Tensor[(1, 12, 12, 64), int8] */;
  %42(%cmsis-nn_10_i0, %tvm_var_extract_const_186, %tvm_var_extract_const_187, %tvm_var_extract_const_188, %tvm_var_extract_const_189, %tvm_var_extract_const_190, %tvm_var_extract_const_191) /* ty=Tensor[(1, 12, 12, 64), int8] */
}

def @tvmgen_default_cmsis_nn_main_11(%cmsis-nn_11_i0: Tensor[(1, 12, 12, 64), int8] /* ty=Tensor[(1, 12, 12, 64), int8] */, %tvm_var_extract_const_204: Tensor[(3, 3, 64, 1), int8] /* ty=Tensor[(3, 3, 64, 1), int8] */, %tvm_var_extract_const_205: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, %tvm_var_extract_const_206: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %tvm_var_extract_const_207: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, %tvm_var_extract_const_208: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %tvm_var_extract_const_209: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, Compiler="cmsis-nn", Primitive=1, Inline=1, global_symbol="tvmgen_default_cmsis_nn_main_11") -> Tensor[(1, 6, 6, 64), int8] {
  %46 = fn (%FunctionVar_15_0: Tensor[(1, 12, 12, 64), int8] /* ty=Tensor[(1, 12, 12, 64), int8] */, %tvm_var_extract_const_198: Tensor[(3, 3, 64, 1), int8] /* ty=Tensor[(3, 3, 64, 1), int8] */, %tvm_var_extract_const_199: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, %tvm_var_extract_const_200: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %tvm_var_extract_const_201: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, %tvm_var_extract_const_202: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %tvm_var_extract_const_203: Tensor[(64), int32] /* ty=Tensor[(64), int32] */, PartitionedFromPattern="qnn.conv2d_nn.bias_add_qnn.requantize_clip_", Composite="cmsis-nn.qnn_conv2d") -> Tensor[(1, 6, 6, 64), int8] {
    %43 = qnn.conv2d(%FunctionVar_15_0, %tvm_var_extract_const_198, -128 /* ty=int32 span=model/activation_11/Relu;model/batch_normalization_11/FusedBatchNormV3;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_5/BiasAdd;model/depthwise_conv2d_5/BiasAdd/ReadVariableOp/resource1:0:0 */, %tvm_var_extract_const_199, 0.0296601f /* ty=float32 span=model/activation_11/Relu;model/batch_normalization_11/FusedBatchNormV3;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_5/BiasAdd;model/depthwise_conv2d_5/BiasAdd/ReadVariableOp/resource1:0:0 */, %tvm_var_extract_const_200, strides=[2, 2], padding=[0, 0, 1, 1], groups=64, channels=64, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="int32") /* ty=Tensor[(1, 6, 6, 64), int32] span=model/activation_11/Relu;model/batch_normalization_11/FusedBatchNormV3;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_5/BiasAdd;model/depthwise_conv2d_5/BiasAdd/ReadVariableOp/resource1:0:0 */;
    %44 = nn.bias_add(%43, %tvm_var_extract_const_201, axis=3) /* ty=Tensor[(1, 6, 6, 64), int32] span=model/activation_11/Relu;model/batch_normalization_11/FusedBatchNormV3;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_5/BiasAdd;model/depthwise_conv2d_5/BiasAdd/ReadVariableOp/resource1:0:0 */;
    %45 = qnn.requantize(%44, %tvm_var_extract_const_202, %tvm_var_extract_const_203, 0.0324266f /* ty=float32 span=model/activation_11/Relu;model/batch_normalization_11/FusedBatchNormV3;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_5/BiasAdd;model/depthwise_conv2d_5/BiasAdd/ReadVariableOp/resource1:0:0 */, -128 /* ty=int32 span=model/activation_11/Relu;model/batch_normalization_11/FusedBatchNormV3;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_5/BiasAdd;model/depthwise_conv2d_5/BiasAdd/ReadVariableOp/resource1:0:0 */, axis=3, out_dtype="int8") /* ty=Tensor[(1, 6, 6, 64), int8] span=model/activation_11/Relu;model/batch_normalization_11/FusedBatchNormV3;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_5/BiasAdd;model/depthwise_conv2d_5/BiasAdd/ReadVariableOp/resource1:0:0 */;
    clip(%45, a_min=-128f, a_max=127f) /* ty=Tensor[(1, 6, 6, 64), int8] span=model/activation_11/Relu;model/batch_normalization_11/FusedBatchNormV3;model/depthwise_conv2d_5/depthwise;model/depthwise_conv2d_5/BiasAdd;model/depthwise_conv2d_5/BiasAdd/ReadVariableOp/resource1:0:0 */
  } /* ty=fn (Tensor[(1, 12, 12, 64), int8], Tensor[(3, 3, 64, 1), int8], Tensor[(64), int32], Tensor[(64), float32], Tensor[(64), int32], Tensor[(64), float32], Tensor[(64), int32]) -> Tensor[(1, 6, 6, 64), int8] */;
  %46(%cmsis-nn_11_i0, %tvm_var_extract_const_204, %tvm_var_extract_const_205, %tvm_var_extract_const_206, %tvm_var_extract_const_207, %tvm_var_extract_const_208, %tvm_var_extract_const_209) /* ty=Tensor[(1, 6, 6, 64), int8] */
}

def @tvmgen_default_cmsis_nn_main_12(%cmsis-nn_12_i0: Tensor[(1, 6, 6, 64), int8] /* ty=Tensor[(1, 6, 6, 64), int8] */, %tvm_var_extract_const_222: Tensor[(128, 1, 1, 64), int8] /* ty=Tensor[(128, 1, 1, 64), int8] */, %tvm_var_extract_const_223: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, %tvm_var_extract_const_224: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %tvm_var_extract_const_225: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, %tvm_var_extract_const_226: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %tvm_var_extract_const_227: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, Compiler="cmsis-nn", Primitive=1, Inline=1, global_symbol="tvmgen_default_cmsis_nn_main_12") -> Tensor[(1, 6, 6, 128), int8] {
  %50 = fn (%FunctionVar_14_0: Tensor[(1, 6, 6, 64), int8] /* ty=Tensor[(1, 6, 6, 64), int8] */, %tvm_var_extract_const_216: Tensor[(128, 1, 1, 64), int8] /* ty=Tensor[(128, 1, 1, 64), int8] */, %tvm_var_extract_const_217: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, %tvm_var_extract_const_218: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %tvm_var_extract_const_219: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, %tvm_var_extract_const_220: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %tvm_var_extract_const_221: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, PartitionedFromPattern="qnn.conv2d_nn.bias_add_qnn.requantize_clip_", Composite="cmsis-nn.qnn_conv2d") -> Tensor[(1, 6, 6, 128), int8] {
    %47 = qnn.conv2d(%FunctionVar_14_0, %tvm_var_extract_const_216, -128 /* ty=int32 span=model/activation_12/Relu;model/batch_normalization_12/FusedBatchNormV3;model/conv2d_6/BiasAdd/ReadVariableOp/resource;model/conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_6/Conv2D1:0:0 */, %tvm_var_extract_const_217, 0.0324266f /* ty=float32 span=model/activation_12/Relu;model/batch_normalization_12/FusedBatchNormV3;model/conv2d_6/BiasAdd/ReadVariableOp/resource;model/conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_6/Conv2D1:0:0 */, %tvm_var_extract_const_218, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1], data_layout="NHWC", kernel_layout="OHWI", out_dtype="int32") /* ty=Tensor[(1, 6, 6, 128), int32] span=model/activation_12/Relu;model/batch_normalization_12/FusedBatchNormV3;model/conv2d_6/BiasAdd/ReadVariableOp/resource;model/conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_6/Conv2D1:0:0 */;
    %48 = nn.bias_add(%47, %tvm_var_extract_const_219, axis=3) /* ty=Tensor[(1, 6, 6, 128), int32] span=model/activation_12/Relu;model/batch_normalization_12/FusedBatchNormV3;model/conv2d_6/BiasAdd/ReadVariableOp/resource;model/conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_6/Conv2D1:0:0 */;
    %49 = qnn.requantize(%48, %tvm_var_extract_const_220, %tvm_var_extract_const_221, 0.030614f /* ty=float32 span=model/activation_12/Relu;model/batch_normalization_12/FusedBatchNormV3;model/conv2d_6/BiasAdd/ReadVariableOp/resource;model/conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_6/Conv2D1:0:0 */, -128 /* ty=int32 span=model/activation_12/Relu;model/batch_normalization_12/FusedBatchNormV3;model/conv2d_6/BiasAdd/ReadVariableOp/resource;model/conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_6/Conv2D1:0:0 */, axis=3, out_dtype="int8") /* ty=Tensor[(1, 6, 6, 128), int8] span=model/activation_12/Relu;model/batch_normalization_12/FusedBatchNormV3;model/conv2d_6/BiasAdd/ReadVariableOp/resource;model/conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_6/Conv2D1:0:0 */;
    clip(%49, a_min=-128f, a_max=127f) /* ty=Tensor[(1, 6, 6, 128), int8] span=model/activation_12/Relu;model/batch_normalization_12/FusedBatchNormV3;model/conv2d_6/BiasAdd/ReadVariableOp/resource;model/conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_6/Conv2D1:0:0 */
  } /* ty=fn (Tensor[(1, 6, 6, 64), int8], Tensor[(128, 1, 1, 64), int8], Tensor[(128), int32], Tensor[(128), float32], Tensor[(128), int32], Tensor[(128), float32], Tensor[(128), int32]) -> Tensor[(1, 6, 6, 128), int8] */;
  %50(%cmsis-nn_12_i0, %tvm_var_extract_const_222, %tvm_var_extract_const_223, %tvm_var_extract_const_224, %tvm_var_extract_const_225, %tvm_var_extract_const_226, %tvm_var_extract_const_227) /* ty=Tensor[(1, 6, 6, 128), int8] */
}

def @tvmgen_default_cmsis_nn_main_13(%cmsis-nn_13_i0: Tensor[(1, 6, 6, 128), int8] /* ty=Tensor[(1, 6, 6, 128), int8] */, %tvm_var_extract_const_240: Tensor[(3, 3, 128, 1), int8] /* ty=Tensor[(3, 3, 128, 1), int8] */, %tvm_var_extract_const_241: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, %tvm_var_extract_const_242: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %tvm_var_extract_const_243: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, %tvm_var_extract_const_244: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %tvm_var_extract_const_245: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, Compiler="cmsis-nn", Primitive=1, Inline=1, global_symbol="tvmgen_default_cmsis_nn_main_13") -> Tensor[(1, 6, 6, 128), int8] {
  %54 = fn (%FunctionVar_13_0: Tensor[(1, 6, 6, 128), int8] /* ty=Tensor[(1, 6, 6, 128), int8] */, %tvm_var_extract_const_234: Tensor[(3, 3, 128, 1), int8] /* ty=Tensor[(3, 3, 128, 1), int8] */, %tvm_var_extract_const_235: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, %tvm_var_extract_const_236: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %tvm_var_extract_const_237: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, %tvm_var_extract_const_238: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %tvm_var_extract_const_239: Tensor[(128), int32] /* ty=Tensor[(128), int32] */, PartitionedFromPattern="qnn.conv2d_nn.bias_add_qnn.requantize_clip_", Composite="cmsis-nn.qnn_conv2d") -> Tensor[(1, 6, 6, 128), int8] {
    %51 = qnn.conv2d(%FunctionVar_13_0, %tvm_var_extract_const_234, -128 /* ty=int32 span=model/activation_13/Relu;model/batch_normalization_13/FusedBatchNormV3;model/depthwise_conv2d_6/depthwise;model/depthwise_conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_6/BiasAdd/ReadVariableOp/resource1:0:0 */, %tvm_var_extract_const_235, 0.030614f /* ty=float32 span=model/activation_13/Relu;model/batch_normalization_13/FusedBatchNormV3;model/depthwise_conv2d_6/depthwise;model/depthwise_conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_6/BiasAdd/ReadVariableOp/resource1:0:0 */, %tvm_var_extract_const_236, padding=[1, 1, 1, 1], groups=128, channels=128, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="int32") /* ty=Tensor[(1, 6, 6, 128), int32] span=model/activation_13/Relu;model/batch_normalization_13/FusedBatchNormV3;model/depthwise_conv2d_6/depthwise;model/depthwise_conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_6/BiasAdd/ReadVariableOp/resource1:0:0 */;
    %52 = nn.bias_add(%51, %tvm_var_extract_const_237, axis=3) /* ty=Tensor[(1, 6, 6, 128), int32] span=model/activation_13/Relu;model/batch_normalization_13/FusedBatchNormV3;model/depthwise_conv2d_6/depthwise;model/depthwise_conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_6/BiasAdd/ReadVariableOp/resource1:0:0 */;
    %53 = qnn.requantize(%52, %tvm_var_extract_const_238, %tvm_var_extract_const_239, 0.0296805f /* ty=float32 span=model/activation_13/Relu;model/batch_normalization_13/FusedBatchNormV3;model/depthwise_conv2d_6/depthwise;model/depthwise_conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_6/BiasAdd/ReadVariableOp/resource1:0:0 */, -128 /* ty=int32 span=model/activation_13/Relu;model/batch_normalization_13/FusedBatchNormV3;model/depthwise_conv2d_6/depthwise;model/depthwise_conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_6/BiasAdd/ReadVariableOp/resource1:0:0 */, axis=3, out_dtype="int8") /* ty=Tensor[(1, 6, 6, 128), int8] span=model/activation_13/Relu;model/batch_normalization_13/FusedBatchNormV3;model/depthwise_conv2d_6/depthwise;model/depthwise_conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_6/BiasAdd/ReadVariableOp/resource1:0:0 */;
    clip(%53, a_min=-128f, a_max=127f) /* ty=Tensor[(1, 6, 6, 128), int8] span=model/activation_13/Relu;model/batch_normalization_13/FusedBatchNormV3;model/depthwise_conv2d_6/depthwise;model/depthwise_conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/depthwise_conv2d_6/BiasAdd/ReadVariableOp/resource1:0:0 */
  } /* ty=fn (Tensor[(1, 6, 6, 128), int8], Tensor[(3, 3, 128, 1), int8], Tensor[(128), int32], Tensor[(128), float32], Tensor[(128), int32], Tensor[(128), float32], Tensor[(128), int32]) -> Tensor[(1, 6, 6, 128), int8] */;
  %54(%cmsis-nn_13_i0, %tvm_var_extract_const_240, %tvm_var_extract_const_241, %tvm_var_extract_const_242, %tvm_var_extract_const_243, %tvm_var_extract_const_244, %tvm_var_extract_const_245) /* ty=Tensor[(1, 6, 6, 128), int8] */
}

