def @main(%input_1: Tensor[(1, 49, 10, 1), int8] /* span=input_1:0:0 */, %v_param_1: Tensor[(10, 4, 1, 64), int8] /* span=functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D:0:0 */, %v_param_2: Tensor[(64), int32] /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D:0:0 */, %v_param_3: Tensor[(3, 3, 64, 1), int8] /* span=functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_6:0:0 */, %v_param_4: Tensor[(64), int32] /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_6:0:0 */, %v_param_5: Tensor[(1, 1, 64, 64), int8] /* span=functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D:0:0 */, %v_param_6: Tensor[(64), int32] /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D:0:0 */, %v_param_7: Tensor[(3, 3, 64, 1), int8] /* span=functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_18:0:0 */, %v_param_8: Tensor[(64), int32] /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_18:0:0 */, %v_param_9: Tensor[(1, 1, 64, 64), int8] /* span=functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D:0:0 */, %v_param_10: Tensor[(64), int32] /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D:0:0 */, %v_param_11: Tensor[(3, 3, 64, 1), int8] /* span=functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_30:0:0 */, %v_param_12: Tensor[(64), int32] /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_30:0:0 */, %v_param_13: Tensor[(1, 1, 64, 64), int8] /* span=functional_1/conv2d_3/Conv2D;StatefulPartitionedCall/functional_1/conv2d_3/Conv2D:0:0 */, %v_param_14: Tensor[(64), int32] /* span=functional_1/activation_6/Relu;StatefulPartitionedCall/functional_1/activation_6/Relu;functional_1/batch_normalization_6/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_6/FusedBatchNormV3;unknown_36;functional_1/conv2d_3/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_3/Conv2D;StatefulPartitionedCall/functional_1/conv2d_3/Conv2D:0:0 */, %v_param_15: Tensor[(3, 3, 64, 1), int8] /* span=functional_1/batch_normalization_7/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_7/FusedBatchNormV3;functional_1/depthwise_conv2d_3/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_3/depthwise;functional_1/depthwise_conv2d_3/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_42:0:0 */, %v_param_16: Tensor[(64), int32] /* span=functional_1/activation_7/Relu;StatefulPartitionedCall/functional_1/activation_7/Relu;functional_1/batch_normalization_7/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_7/FusedBatchNormV3;functional_1/depthwise_conv2d_3/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_3/depthwise;functional_1/depthwise_conv2d_3/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_42:0:0 */, %v_param_17: Tensor[(1, 1, 64, 64), int8] /* span=functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D:0:0 */, %v_param_18: Tensor[(64), int32] /* span=functional_1/activation_8/Relu;StatefulPartitionedCall/functional_1/activation_8/Relu;functional_1/batch_normalization_8/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_8/FusedBatchNormV3;unknown_48;functional_1/conv2d_4/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_4/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D:0:0 */, %v_param_19: Tensor[(12, 64), int8] /* span=functional_1/dense/MatMul;StatefulPartitionedCall/functional_1/dense/MatMul:0:0 */, %v_param_20: Tensor[(12), int32] /* span=unknown_54:0:0 */, output_tensor_names=["Identity"]) {
  %0 = qnn.conv2d(%input_1, %v_param_1, 87 /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */, 0 /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */, 0.574836f /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */, meta[relay.Constant][0] /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */, strides=[2, 2], padding=[4, 1, 5, 1], channels=64, kernel_size=[10, 4], data_layout="NHWC", kernel_layout="HWIO", out_dtype="int32") /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */;
  %1 = nn.bias_add(%0, %v_param_2, axis=3) /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */;
  %2 = qnn.requantize(%1, meta[relay.Constant][1] /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */, 0 /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */, 0.106924f /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */, -128 /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */, axis=3, rounding="UPWARD", compute_dtype="int64", out_dtype="int8") /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */;
  %3 = clip(%2, a_min=-128f, a_max=127f) /* span=functional_1/activation/Relu;StatefulPartitionedCall/functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3;unknown_0;functional_1/conv2d/BiasAdd;StatefulPartitionedCall/functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D;StatefulPartitionedCall/functional_1/conv2d/Conv2D1:0:0 */;
  %4 = qnn.conv2d(%3, %v_param_3, -128 /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */, 0 /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */, 0.106924f /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */, meta[relay.Constant][2] /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */, padding=[1, 1, 1, 1], groups=64, channels=64, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="int32") /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */;
  %5 = nn.bias_add(%4, %v_param_4, axis=3) /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */;
  %6 = qnn.requantize(%5, meta[relay.Constant][3] /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */, 0 /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */, 0.0957676f /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */, -128 /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */, axis=3, rounding="UPWARD", compute_dtype="int64", out_dtype="int8") /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */;
  %7 = clip(%6, a_min=-128f, a_max=127f) /* span=functional_1/activation_1/Relu;StatefulPartitionedCall/functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_61:0:0 */;
  %8 = qnn.conv2d(%7, %v_param_5, -128 /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */, 0 /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */, 0.0957676f /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */, meta[relay.Constant][4] /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1], data_layout="NHWC", kernel_layout="HWIO", out_dtype="int32") /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */;
  %9 = nn.bias_add(%8, %v_param_6, axis=3) /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */;
  %10 = qnn.requantize(%9, meta[relay.Constant][5] /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */, 0 /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */, 0.0755872f /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */, -128 /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */, axis=3, rounding="UPWARD", compute_dtype="int64", out_dtype="int8") /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */;
  %11 = clip(%10, a_min=-128f, a_max=127f) /* span=functional_1/activation_2/Relu;StatefulPartitionedCall/functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3;unknown_12;functional_1/conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D;StatefulPartitionedCall/functional_1/conv2d_1/Conv2D1:0:0 */;
  %12 = qnn.conv2d(%11, %v_param_7, -128 /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */, 0 /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */, 0.0755872f /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */, meta[relay.Constant][6] /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */, padding=[1, 1, 1, 1], groups=64, channels=64, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="int32") /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */;
  %13 = nn.bias_add(%12, %v_param_8, axis=3) /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */;
  %14 = qnn.requantize(%13, meta[relay.Constant][7] /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */, 0 /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */, 0.0674262f /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */, -128 /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */, axis=3, rounding="UPWARD", compute_dtype="int64", out_dtype="int8") /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */;
  %15 = clip(%14, a_min=-128f, a_max=127f) /* span=functional_1/activation_3/Relu;StatefulPartitionedCall/functional_1/activation_3/Relu;functional_1/batch_normalization_3/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3;functional_1/depthwise_conv2d_1/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/depthwise;functional_1/depthwise_conv2d_1/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_181:0:0 */;
  %16 = qnn.conv2d(%15, %v_param_9, -128 /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */, 0 /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */, 0.0674262f /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */, meta[relay.Constant][8] /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1], data_layout="NHWC", kernel_layout="HWIO", out_dtype="int32") /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */;
  %17 = nn.bias_add(%16, %v_param_10, axis=3) /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */;
  %18 = qnn.requantize(%17, meta[relay.Constant][9] /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */, 0 /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */, 0.0540593f /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */, -128 /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */, axis=3, rounding="UPWARD", compute_dtype="int64", out_dtype="int8") /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */;
  %19 = clip(%18, a_min=-128f, a_max=127f) /* span=functional_1/activation_4/Relu;StatefulPartitionedCall/functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3;unknown_24;functional_1/conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D;StatefulPartitionedCall/functional_1/conv2d_2/Conv2D1:0:0 */;
  %20 = qnn.conv2d(%19, %v_param_11, -128 /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */, 0 /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */, 0.0540593f /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */, meta[relay.Constant][10] /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */, padding=[1, 1, 1, 1], groups=64, channels=64, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="int32") /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */;
  %21 = nn.bias_add(%20, %v_param_12, axis=3) /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */;
  %22 = qnn.requantize(%21, meta[relay.Constant][11] /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */, 0 /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */, 0.0536146f /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */, -128 /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */, axis=3, rounding="UPWARD", compute_dtype="int64", out_dtype="int8") /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */;
  %23 = clip(%22, a_min=-128f, a_max=127f) /* span=functional_1/activation_5/Relu;StatefulPartitionedCall/functional_1/activation_5/Relu;functional_1/batch_normalization_5/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3;functional_1/depthwise_conv2d_2/depthwise;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/depthwise;functional_1/depthwise_conv2d_2/BiasAdd;StatefulPartitionedCall/functional_1/depthwise_conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;unknown_301:0:0 */;
  %24 = qnn.conv2d(%23, %v_param_13, -128 /* span=functional_1/activation_6/Relu;StatefulPartitionedCall/functional_1/activation_6/Relu;functional_1/batch_normalization_6/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_6/FusedBatchNormV3;unknown_36;functional_1/conv2d_3/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_3/Conv2D;StatefulPartitionedCall/functional_1/conv2d_3/Conv2D1:0:0 */, 0 /* span=functional_1/activation_6/Relu;StatefulPartitionedCall/functional_1/activation_6/Relu;functional_1/batch_normalization_6/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_6/FusedBatchNormV3;unknown_36;functional_1/conv2d_3/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_3/Conv2D;StatefulPartitionedCall/functional_1/conv2d_3/Conv2D1:0:0 */, 0.0536146f /* span=functional_1/activation_6/Relu;StatefulPartitionedCall/functional_1/activation_6/Relu;functional_1/batch_normalization_6/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_6/FusedBatchNormV3;unknown_36;functional_1/conv2d_3/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_3/Conv2D;StatefulPartitionedCall/functional_1/conv2d_3/Conv2D1:0:0 */, meta[relay.Constant][12] /* span=functional_1/activation_6/Relu;StatefulPartitionedCall/functional_1/activation_6/Relu;functional_1/batch_normalization_6/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_6/FusedBatchNormV3;unknown_36;functional_1/conv2d_3/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_3/Conv2D;StatefulPartitionedCall/functional_1/conv2d_3/Conv2D1:0:0 */, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1], data_layout="NHWC", kernel_layout="HWIO", out_dtype="int32") /* span=functional_1/activation_6/Relu;StatefulPartitionedCall/functional_1/activation_6/Relu;functional_1/batch_normalization_6/FusedBatchNormV3;StatefulPartitionedCall/functional_1/batch_normalization_6/FusedBatchNormV3;unknown_36;functional_1/conv2d_3/BiasAdd;StatefulPartitionedCall/functional_1/conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;StatefulPartitionedCall/functional_1/conv2d_4/Conv2D;functional_1/conv2d_3/Conv2D;StatefulPartitionedCall/functional_1/conv2d_3/Conv2D1:0:0 */;
